rkz/extension/DataProcessors/ФормированиеСменныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФормированиеСменныхЗаданий</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

rkz/extension/InformationRegisters/бит_СоставИсполнителейИВремяВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>бит_СоставИсполнителейИВремяВыполнения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЧасыНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЧасыФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СменноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументПроизводства</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

rkz/extension/DataProcessors/ФормированиеСменныхЗаданий/Forms/РабочееМесто/Ext/Form/Module.bsl
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.1] [ASHolyavko@1cbit.ru] [09.11.2025] +        
	
	НоваяСтраница = Этаформа.Элементы.Вставить("бит_СтраницаСоставыБригад", Тип("ГруппаФормы"), ЭтаФорма.Элементы.Страницы, Неопределено);
	НоваяСтраница.Вид = ВидГруппыФормы.Страница;
	НоваяСтраница.Заголовок = "(бит) Должности и типы начислений"; 
	
	НоваяГруппа = Этаформа.Элементы.Вставить("бит_ГруппаСоставыБригад", Тип("ГруппаФормы"), ЭтаФорма.Элементы.бит_СтраницаСоставыБригад, Неопределено);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	МассивТиповБригада = Новый Массив;
	МассивТиповБригада.Добавить(Тип("СправочникСсылка.Бригады"));
	МассивТиповБригада.Добавить(Тип("СправочникСсылка.Сотрудники"));
	
	
	МассивРеквизитов = Новый Массив;
	//Новая ТЗ
	МассивРеквизитов.Добавить(Новый РеквизитФормы("бит_Смена", Новый ОписаниеТипов("ТаблицаЗначений")));    
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Дата", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)), "бит_Смена")); 
	МассивРеквизитов.Добавить(Новый РеквизитФормы("СменноеЗадание", Новый ОписаниеТипов("ДокументСсылка.СменноеЗадание"), "бит_Смена", "Сменное задание")); 
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ОперацияВыпуска", Новый ОписаниеТипов("ДокументСсылка.ПроизводственнаяОперация2_2"), "бит_Смена", "Операция выпуска")); 
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Бригада", Новый ОписаниеТипов(МассивТиповБригада), "бит_Смена"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Состав", Новый ОписаниеТипов("Булево"), "бит_Смена"));
	
	Попытка	
		ИзменитьРеквизиты(МассивРеквизитов);  
	Исключение
	КонецПопытки;
	
	//МассивРеквизитов.Добавить(Новый РеквизитФормы("бит_Состав", Новый ОписаниеТипов("ТаблицаЗначений")));    
	//МассивРеквизитов.Добавить(Новый РеквизитФормы("Бригада", Новый ОписаниеТипов("СправочникСсылка.Бригады"), "бит_Состав"));
	//МассивРеквизитов.Добавить(Новый РеквизитФормы("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"), "бит_Состав")); 
	//МассивРеквизитов.Добавить(Новый РеквизитФормы("СменноеЗадание", Новый ОписаниеТипов("ДокументСсылка.СменноеЗадание"), "бит_Состав", "Сменное задание")); 
	//МассивРеквизитов.Добавить(Новый РеквизитФормы("ОперацияВыпуска", Новый ОписаниеТипов("ДокументСсылка.ПроизводственнаяОперация2_2"), "бит_Состав", "Операция выпуска"));
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Смена", Тип("ТаблицаФормы"), Этаформа.Элементы.бит_ГруппаСоставыБригад, Неопределено);
	НовыйЭлемент.ПутьКДанным = "бит_Смена";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.АвтоВводНовойСтроки = Ложь;
	НовыйЭлемент.ВысотаВСтрокахТаблицы = 6;
	НовыйЭлемент.Отображение = ОтображениеТаблицы.Список;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Верх;
	НовыйЭлемент.УстановитьДействие("ПриАктивизацииСтроки", "бит_СменаПриАктивизацииСтроки");
	НовыйЭлемент.УстановитьДействие("Выбор", "бит_СменаВыбор");
	Для Каждого ПЭ Из НовыйЭлемент.КоманднаяПанель.ПодчиненныеЭлементы Цикл
		ПЭ.Видимость = Ложь;
		ПЭ.Доступность = Ложь;
	КонецЦикла;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СменаДата", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_Смена, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_Смена.Дата";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СменаСменноеЗадание", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_Смена, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_Смена.СменноеЗадание";
	
	//НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СменаОперацияВыпуска", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_Смена, Неопределено);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "бит_Смена.ОперацияВыпуска";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СменаБригада", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_Смена, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_Смена.Бригада";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СменаСостав", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_Смена, Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "бит_Смена.Состав";
	
	ГруппаДинамическогоСписка  = Элементы.Вставить("Группабит_СоставСписок", Тип("ГруппаФормы"), ЭтаФорма.Элементы.бит_ГруппаСоставыБригад);			
	ГруппаДинамическогоСписка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДинамическогоСписка.ОтображатьЗаголовок = Ложь;
	ГруппаДинамическогоСписка.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаДинамическогоСписка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	КоманднаяПанельСписка  = Элементы.Добавить("бит_СоставСписокКоманднаяПанель2", Тип("ГруппаФормы"), ГруппаДинамическогоСписка);
	КоманднаяПанельСписка.Вид = ВидГруппыФормы.КоманднаяПанель;
	
	//Кнопка
	Команда = ЭтаФорма.Команды.Добавить("СоздатьЗаписьСостава");
	Команда.Действие = "СоздатьЗаписьСостава";
	Команда.Заголовок = "Создать";
	
	//Добавляем новую кнопку
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("СоздатьЗаписьСостава", Тип("КнопкаФормы"), КоманднаяПанельСписка);
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.Заголовок = "Создать";
	НовыйЭлемент.ИмяКоманды = "СоздатьЗаписьСостава";
	
	
	//Создаем реквизит формы      
	ТипыРеквизита = Новый Массив;                             
	ТипыРеквизита.Добавить(Тип("ДинамическийСписок"));
	ОписаниеТиповДляРеквизита = Новый ОписаниеТипов(ТипыРеквизита); 
	ДинамическийСписок = Новый РеквизитФормы("бит_СоставСписок", ОписаниеТиповДляРеквизита, , "", Ложь); //Имя реквизита
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(ДинамическийСписок);        
	
	//Задаем свойства реквизиту
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);        
	РеквизитДинамическийСписок = ЭтаФорма["бит_СоставСписок"]; //Имя реквизита
	РеквизитДинамическийСписок.ПроизвольныйЗапрос = Истина;
	РеквизитДинамическийСписок.ТекстЗапроса = "ВЫБРАТЬ
	                                          |	(ВЫРАЗИТЬ(бит_СоставСписок.ДокументПроизводства.Наименование КАК СТРОКА(255))) + "" / "" + бит_СоставСписок.ДокументПроизводства.Операция.бит_КодОперации.Наименование КАК Операция,
	                                          |	бит_СоставСписок.Сотрудник КАК Сотрудник,
	                                          |	бит_СоставСписок.Должность КАК Должность,
	                                          |	бит_СоставСписок.Разряд КАК Разряд,
	                                          |	бит_СоставСписок.Начисление КАК Начисление
	                                          |ИЗ
	                                          |	РегистрСведений.бит_СоставИсполнителейИВремяВыполнения КАК бит_СоставСписок
	                                          |ГДЕ
	                                          |	бит_СоставСписок.Смена = &Смена
	                                          |	И ВЫБОР
	                                          |			КОГДА ТИПЗНАЧЕНИЯ(&Бригада) = ТИПЗНАЧЕНИЯ(ЗНАЧЕНИЕ(Справочник.Бригады.ПустаяСсылка))
	                                          |				ТОГДА бит_СоставСписок.Бригада = &Бригада
	                                          |			ИНАЧЕ бит_СоставСписок.Сотрудник = &Бригада
	                                          |					И бит_СоставСписок.Бригада = ЗНАЧЕНИЕ(Справочник.Бригады.ПустаяСсылка)
	                                          |		КОНЕЦ
	                                          |	И бит_СоставСписок.ДокументПроизводства = НЕОПРЕДЕЛЕНО";
	РеквизитДинамическийСписок.ОсновнаяТаблица = "РегистрСведений.бит_СоставИсполнителейИВремяВыполнения"; 
	
	РеквизитДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Смена", Неопределено);
	РеквизитДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Бригада", Неопределено);
	
	ТаблицаФормы = Элементы.Добавить("бит_СоставСписок", Тип("ТаблицаФормы"), ГруппаДинамическогоСписка);	
	ТаблицаФормы.ПутьКДанным = "бит_СоставСписок";	
	
	ТаблицаФормы.УстановитьДействие("Выбор", "бит_СоставСписокВыбор");
	
	Для Каждого ПЭ Из ТаблицаФормы.КоманднаяПанель.ПодчиненныеЭлементы Цикл
		ПЭ.Видимость = Ложь;
		ПЭ.Доступность = Ложь;
	КонецЦикла;
	
	Элементы["бит_СоставСписок"].ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	
	МассивКолонок = Новый Массив;
	//МассивКолонок.Добавить("Операция");
	МассивКолонок.Добавить("Сотрудник");
	МассивКолонок.Добавить("Должность");
	МассивКолонок.Добавить("Разряд");
	МассивКолонок.Добавить("Начисление");
	
	Для Каждого Элемента Из МассивКолонок Цикл
		ПараметрыКолонки = СтрЗаменить(Элемента,",",Символы.ПС);
		Если СтрЧислоСтрок(ПараметрыКолонки) > 1 Тогда
			//Заголовок = СтрПолучитьСтроку(ПараметрыКолонки, 1);
			ИмяКолонки = СтрПолучитьСтроку(ПараметрыКолонки, 2);
		Иначе
			//Заголовок = "";
			ИмяКолонки = ПараметрыКолонки; 
		КонецЕсли;	
		НоваяКолонкаТаблицы = Элементы.Добавить("бит_СоставСписок" + ИмяКолонки, Тип("ПолеФормы"), ТаблицаФормы);
		НоваяКолонкаТаблицы.ПутьКДанным = "бит_СоставСписок" + "." + ИмяКолонки; 	
	КонецЦикла;
	
	//НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Состав", Тип("ТаблицаФормы"), Этаформа.Элементы.бит_ГруппаСоставыБригад, Неопределено);
	//НовыйЭлемент.ПутьКДанным = "бит_Состав";
	//НовыйЭлемент.АвтоВводНовойСтроки = Ложь;
	//НовыйЭлемент.ВысотаВСтрокахТаблицы = 6;
	//НовыйЭлемент.Отображение = ОтображениеТаблицы.Список;
	//НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	//НовыйЭлемент.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Верх;
	//НовыйЭлемент.УстановитьДействие("ПослеУдаления", "бит_СоставПослеУдаления");
	//НовыйЭлемент.УстановитьДействие("ПередНачаломДобавления", "бит_СоставСотрудникПередНачаломДобавления");
	//Для Каждого ПЭ Из НовыйЭлемент.КоманднаяПанель.ПодчиненныеЭлементы Цикл
	//	ПЭ.Видимость = Ложь;
	//	ПЭ.Доступность = Ложь;
	//КонецЦикла;	
	//
	//НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставСмена", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_Состав, Неопределено);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "бит_Состав.СменноеЗадание";
	//НовыйЭлемент.Видимость = Ложь;
	//
	//НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставОперацияВыпуска", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_Состав, Неопределено);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "бит_Состав.ОперацияВыпуска";
	//НовыйЭлемент.Видимость = Ложь;
	//
	//НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригада", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_Состав, Неопределено);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "бит_Состав.Бригада";
	//НовыйЭлемент.Видимость = Ложь;
	//
	//НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставСотрудник", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_Состав, Неопределено);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "бит_Состав.Сотрудник";
	//НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_СоставСотрудникПриИзменении");
		
	//Кнопка
	//Команда = ЭтаФорма.Команды.Добавить("ЗаполнитьПоследнимСоставом");
	//Команда.Действие = "ЗаполнитьПоследнимСоставом";
	//Команда.Заголовок = "(бит) Заполнить последним составом";
	//
	////Добавляем новую кнопку
	//НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ЗаполнитьПоследнимСоставом", Тип("КнопкаФормы"), ЭтаФорма.Элементы.бит_Состав.КоманднаяПанель);
	//НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	//НовыйЭлемент.Заголовок = "(бит) Заполнить последним составом";
	//НовыйЭлемент.ИмяКоманды = "ЗаполнитьПоследнимСоставом";
	
	//Кнопка
	Команда = ЭтаФорма.Команды.Добавить("ОбновитьСписокСмен");
	Команда.Действие = "ОбновитьСписокСмен";
	Команда.Заголовок = "(бит) Обновить список смен";
	
	//Добавляем новую кнопку
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ОбновитьСписокСмен", Тип("КнопкаФормы"), ЭтаФорма.Элементы.бит_Смена.КоманднаяПанель);
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.Заголовок = "(бит) Обновить список смен";
	НовыйЭлемент.ИмяКоманды = "ОбновитьСписокСмен";
	
	ЗаполнитьСписокСмен();
	
	//НовыйЭлемент.Отображение = 
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.1] [ASHolyavko@1cbit.ru] [09.11.2025] -
	
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.64] [ASHolyavko@1cbit.ru] [18.01.2026] +        
	
	Если РольДоступна("ПолныеПрава") 
		ИЛИ РольДоступна("бит_ЗаменаОборудования") Тогда
	
		//Кнопка
		Команда = ЭтаФорма.Команды.Добавить("бит_ЗаменитьОборудование");
		Команда.Действие = "бит_ЗаменитьОборудование";
		Команда.Заголовок = "(бит) Заменить оборудование";
		
		//Добавляем новую кнопку
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ЗаменитьОборудование", Тип("КнопкаФормы"), Элементы.КоманднаяПанельОперации);
		НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовыйЭлемент.Заголовок = "(бит) Заменить оборудование";
		НовыйЭлемент.ИмяКоманды = "бит_ЗаменитьОборудование"; 
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.64] [ASHolyavko@1cbit.ru] [18.01.2026] -

	
	// {{ПервыйБИТ ЛистТребований [бн] [ASHolyavko@1cbit.ru] [20.01.2026] +        
	
	ТекстКоличествоОпераций = 
	"ВЫБРАТЬ
	|	ПроизводственнаяОперация2_2.СменноеЗадание КАК СменноеЗадание,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПроизводственнаяОперация2_2.Ссылка) КАК КоличествоОпераций
	|ПОМЕСТИТЬ вт_ПроизводственныеОперации
	|ИЗ
	|	Документ.ПроизводственнаяОперация2_2 КАК ПроизводственнаяОперация2_2
	|ГДЕ
	|	ПроизводственнаяОперация2_2.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПроизводственнаяОперация2_2.СменноеЗадание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НарядОперации.Ссылка.ДокументОснование КАК СменноеЗадание,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_НарядОперации.ДокументОснование) КАК КоличествоОпераций
	|ПОМЕСТИТЬ вт_Наряды
	|ИЗ
	|	Документ.бит_Наряд.Операции КАК бит_НарядОперации
	|ГДЕ
	|	НЕ бит_НарядОперации.Ссылка.ПометкаУдаления
	|	И бит_НарядОперации.Ссылка.ДокументОснование ССЫЛКА Документ.СменноеЗадание
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НарядОперации.Ссылка.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	СменныеЗадания.ТекстЗапроса = ТекстКоличествоОпераций + СменныеЗадания.ТекстЗапроса;
	
	СменныеЗадания.ТекстЗапроса = СтрЗаменить(СменныеЗадания.ТекстЗапроса, 
	"Документ.СменноеЗадание КАК ДокументПереопределяемый",
	"Документ.СменноеЗадание КАК ДокументПереопределяемый
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ПроизводственныеОперации КАК вт_ПроизводственныеОперации
	|		ПО ДокументПереопределяемый.Ссылка = вт_ПроизводственныеОперации.СменноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Наряды КАК вт_Наряды
	|		ПО ДокументПереопределяемый.Ссылка = вт_Наряды.СменноеЗадание");
	
	СменныеЗадания.ТекстЗапроса = СтрЗаменить(СменныеЗадания.ТекстЗапроса, 
	"ДокументПереопределяемый.Ссылка        КАК Ссылка,", 
	"ДокументПереопределяемый.Ссылка        КАК Ссылка, 
	|	ЕСТЬNULL(вт_Наряды.КоличествоОпераций = вт_ПроизводственныеОперации.КоличествоОпераций, ЛОЖЬ)        КАК ВсеОперацииВНарядах,");
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СменныеЗаданияВсеОперацииВНарядах", Тип("ПолеФормы"), Элементы.СменныеЗадания, Элементы.СменныеЗаданияКомментарий);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "СменныеЗадания.ВсеОперацииВНарядах";
	НовыйЭлемент.Заголовок = "(бит) ВсеОперацииВНарядах";
	НовыйЭлемент.Видимость = Ложь;
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СменныеЗадания.Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СменныеЗадания.Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусыСменныхЗаданий.Закрыто;
	ОтборЭлемента.Использование = Истина;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СменныеЗадания.ВсеОперацииВНарядах");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	ОтборЭлемента.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);
	Элемент.Использование = Истина;
	
	// }}ПервыйБИТ ЛистТребований [бн] [ASHolyavko@1cbit.ru] [20.01.2026] -
		
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ЗаменитьОборудование(Команда)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.64] [ASHolyavko@1cbit.ru] [18.01.2026] +        
	ТекущиеДанные = Элементы.Операции.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ВыделенныеСтроки = Элементы.Операции.ВыделенныеСтроки;
		
		АдресТЗОперации = ПолучитьТЗОперации(ВыделенныеСтроки);

		Если АдресТЗОперации <> Неопределено Тогда
			
			ОповещениеПриЗакрытииЗаменыОборудования = Новый ОписаниеОповещения("ОповещениеПриЗакрытииЗаменыОборудования", ЭтотОбъект, ТекущиеДанные.Этап);
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("АдресТЗОперации", АдресТЗОперации);
			ОткрытьФорму("Обработка.ФормированиеСменныхЗаданий.Форма.бит_ФормаЗаменыОборудования", ПараметрыФормы, ЭтаФорма,,,,ОповещениеПриЗакрытииЗаменыОборудования,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			
		КонецЕсли;
		
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.64] [ASHolyavko@1cbit.ru] [18.01.2026] -
	
КонецПроцедуры 

&НаКлиенте
Процедура ОповещениеПриЗакрытииЗаменыОборудования(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		
		ВывестиСообщенияФормирования(Результат, ДополнительныеПараметры);
		
		//Элементы.Операции.Обновить();
	
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ВывестиСообщенияФормирования(Результат, ТекущийЭтап)
				
	СтруктураРезультата = ПолучитьИзВременногоХранилища(Результат);
	
	Ошибки = СтруктураРезультата.Ошибки;
	
	Для Каждого СтрокаОшибок Из Ошибки Цикл
		Если ЗначениеЗаполнено(СтрокаОшибок.Сообщения) Тогда
			
			Сообщить("Ошибка формирование этапа!");
			
			//СообщениеПользователю = Новый СообщениеПользователю;
			//СообщениеПользователю.Текст = "Создан новый документ: " + Строка(СтрокаРезультата.Документ);
			//СообщениеПользователю.УстановитьДанные(СтрокаРезультата.Документ);
			//СообщениеПользователю.Сообщить();
			
		КонецЕсли;
	КонецЦикла;
	
	РезультатФормирования = СтруктураРезультата.РезультатФормирования;
	
	СозданНовыйЭтап = Ложь;
	
	Для Каждого СтрокаРезультата Из РезультатФормирования Цикл
		Если ЗначениеЗаполнено(СтрокаРезультата.Документ) Тогда
			
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Создан новый документ: " + Строка(СтрокаРезультата.Документ);
			СообщениеПользователю.КлючДанных = СтрокаРезультата.Документ;
			СообщениеПользователю.УстановитьДанные(СтрокаРезультата.Документ);
			СообщениеПользователю.Сообщить();
			
			СозданНовыйЭтап = Истина;
			
		КонецЕсли;
	КонецЦикла;
	
	Если СозданНовыйЭтап Тогда
		
		ПричинаОтмены = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ПричинаЗаменыОборудования, ЭтотОбъект, Истина);
		
		СтарыйЭтапОбъект = ТекущийЭтап.ПолучитьОбъект();
		СтарыйЭтапОбъект.КоличествоУпаковокОтменено = СтарыйЭтапОбъект.КоличествоУпаковокПлан - СтарыйЭтапОбъект.КоличествоУпаковокФакт;
		//СтарыйЭтапОбъект.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен;
		СтарыйЭтапОбъект.ОтразитьКоличествоОтмененоВТЧ(ПричинаОтмены);
		СтарыйЭтапОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//СтарыйЭтапОбъект.ПометкаУдаления = Истина;
		//СтарыйЭтапОбъект.Записать(); 
		
		//СообщениеПользователю = Новый СообщениеПользователю;
		//СообщениеПользователю.Текст = "Этап: " + Строка(ТекущийЭтап) + " помечен на удаление!";
		//СообщениеПользователю.КлючДанных = ТекущийЭтап;
		//СообщениеПользователю.УстановитьДанные(ТекущийЭтап);
		//СообщениеПользователю.Сообщить();
		
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОперацииКСозданиюСменныхЗаданий.Подразделение КАК Подразделение,
		|	ОперацииКСозданиюСменныхЗаданий.СменноеЗадание КАК СменноеЗадание,
		|	ОперацииКСозданиюСменныхЗаданий.Этап КАК Этап,
		|	ОперацииКСозданиюСменныхЗаданий.Операция КАК Операция,
		|	ОперацииКСозданиюСменныхЗаданий.ИдентификаторОперации КАК ИдентификаторОперации,
		|	ОперацииКСозданиюСменныхЗаданий.Исполнитель КАК Исполнитель,
		|	ОперацииКСозданиюСменныхЗаданий.Участок КАК Участок,
		|	ОперацииКСозданиюСменныхЗаданий.РабочийЦентр КАК РабочийЦентр,
		|	ОперацииКСозданиюСменныхЗаданий.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	ОперацииКСозданиюСменныхЗаданий.НазначатьНеРанее КАК НазначатьНеРанее
		|ИЗ
		|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК ОперацииКСозданиюСменныхЗаданий
		|ГДЕ
		|	ОперацииКСозданиюСменныхЗаданий.Этап = &Этап
		|	И ОперацииКСозданиюСменныхЗаданий.СменноеЗадание = ЗНАЧЕНИЕ(Документ.СменноеЗадание.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Этап", ТекущийЭтап);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//	
			НЗ = РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.СоздатьНаборЗаписей();
			
			НЗ.Отбор.Подразделение.Установить(ВыборкаДетальныеЗаписи.Подразделение);
			НЗ.Отбор.СменноеЗадание.Установить(ВыборкаДетальныеЗаписи.СменноеЗадание);
			НЗ.Отбор.Этап.Установить(ВыборкаДетальныеЗаписи.Этап);
			НЗ.Отбор.Операция.Установить(ВыборкаДетальныеЗаписи.Операция);
			НЗ.Отбор.ИдентификаторОперации.Установить(ВыборкаДетальныеЗаписи.ИдентификаторОперации);
			НЗ.Отбор.Исполнитель.Установить(ВыборкаДетальныеЗаписи.Исполнитель);
			НЗ.Отбор.Участок.Установить(ВыборкаДетальныеЗаписи.Участок);
			НЗ.Отбор.РабочийЦентр.Установить(ВыборкаДетальныеЗаписи.РабочийЦентр);
			НЗ.Отбор.ВидРабочегоЦентра.Установить(ВыборкаДетальныеЗаписи.ВидРабочегоЦентра);
			НЗ.Отбор.НазначатьНеРанее.Установить(ВыборкаДетальныеЗаписи.НазначатьНеРанее);
			
			НЗ.Записать();
			
		КонецЦикла;
		
		

		
	КонецЕсли;
	
	Элементы.Операции.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТЗОперации(КлючиОпераций)
	
	Порядок = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ОперацииТЗ = РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	Для каждого Ключ Из КлючиОпераций Цикл
		
		НоваяСтрока = ОперацииТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Ключ);
		НоваяСтрока.Порядок = Порядок;
		
		Порядок = Порядок + 1;
		
	КонецЦикла;
	
	Адрес = ПоместитьВоВременноеХранилище(ОперацииТЗ);
	
	Возврат Адрес;
	
КонецФункции

&НаКлиенте
Процедура бит_СоставСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Ключ", ВыбраннаяСтрока);
	ОткрытьФорму("РегистрСведений.бит_СоставИсполнителейИВремяВыполнения.Форма.ФормаЗаписиИзСменногоЗадания", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаписьСостава()
	
	ТекущиеДанные = Элементы.бит_Смена.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ПарамтерыОткрытия = ПолучитьПараметрыОткрытияФормыЗаписиСоставаИсполнителей(ТекущиеДанные.СменноеЗадание, ТекущиеДанные.Бригада);
	
		ОткрытьФорму("РегистрСведений.бит_СоставИсполнителейИВремяВыполнения.Форма.ФормаЗаписиИзСменногоЗадания", ПарамтерыОткрытия);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыОткрытияФормыЗаписиСоставаИсполнителей(СменноеЗадание, Бригада)

	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("СменноеЗадание", СменноеЗадание);
	СтруктураПараметров.Вставить("Бригада", Бригада);
	
	Возврат СтруктураПараметров;

КонецФункции

&НаКлиенте
Процедура бит_СменаВыбор()
	
	ТекущиеДанные = Элементы.бит_Смена.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Структура = Новый Структура("Ключ", ТекущиеДанные.СменноеЗадание);
		ОткрытьФорму("Документ.СменноеЗадание.ФормаОбъекта", Структура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокСмен(Команда)
	ЗаполнитьСписокСмен();
	Элементы.бит_СоставСписок.Обновить();
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьПоследнимСоставом(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоследнимСоставомЗавершение", ЭтотОбъект); 
 	ПоказатьВопрос(ОписаниеОповещения, "Заполнить операцию последним составом бригады?", РежимДиалогаВопрос.ДаНет);

	
	//ЗаполнитьСоставСмен();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоследнимСоставомЗавершение(РезультатВопроса, СтруктураПараметров) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ТекущиеДанные = ЭтаФорма.бит_Смена.ТекущиеДанные;
		
		ЗаполнитьПоследнимСоставомНаСервере(ТекущиеДанные.СменноеЗадание, ТекущиеДанные.ОперацияВыпуска, ТекущиеДанные.Бригада);	
		
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПоследнимСоставомНаСервере(СменноеЗадание, ОперацияВыпуска, Бригада)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	бит_СоставИсполнителейИВремяВыполнения.Регистратор КАК Регистратор,
	//	|	бит_СоставИсполнителейИВремяВыполнения.НомерСтроки КАК НомерСтроки,
	//	|	бит_СоставИсполнителейИВремяВыполнения.Активность КАК Активность,
	//	|	бит_СоставИсполнителейИВремяВыполнения.Смена КАК Смена,
	//	|	бит_СоставИсполнителейИВремяВыполнения.ОперацияВыпуска КАК ОперацияВыпуска,
	//	|	бит_СоставИсполнителейИВремяВыполнения.Бригада КАК Бригада,
	//	|	бит_СоставИсполнителейИВремяВыполнения.Сотрудник КАК Сотрудник,
	//	|	бит_СоставИсполнителейИВремяВыполнения.ЧасыНорма КАК ЧасыНорма,
	//	|	бит_СоставИсполнителейИВремяВыполнения.ЧасыФакт КАК ЧасыФакт,
	//	|	бит_СоставИсполнителейИВремяВыполнения.КоличествоПлан КАК КоличествоПлан,
	//	|	бит_СоставИсполнителейИВремяВыполнения.КоличествоФакт КАК КоличествоФакт
	//	|ИЗ
	//	|	РегистрСведений.бит_СоставИсполнителейИВремяВыполнения КАК бит_СоставИсполнителейИВремяВыполнения
	//	|ГДЕ
	//	|	бит_СоставИсполнителейИВремяВыполнения.Регистратор = &Регистратор
	//	|	И бит_СоставИсполнителейИВремяВыполнения.ОперацияВыпуска <> &ОперацияВыпуска";
	//
	//Запрос.УстановитьПараметр("Регистратор", СменноеЗадание);
	//Запрос.УстановитьПараметр("ОперацияВыпуска", ОперацияВыпуска);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	////Очищаем все записи
	//Набор = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
	//Набор.Отбор.Регистратор.Установить(СменноеЗадание);
	//Набор.Записать();
	//
	////Заполняем записи которые не относятся к этой операции
	//Если Не РезультатЗапроса.Пустой() Тогда
	//	Набор = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
	//	Набор.Отбор.Регистратор.Установить(СменноеЗадание);	
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		Запись = Набор.Добавить();
	//		Запись.Смена = ВыборкаДетальныеЗаписи.Смена;
	//		Запись.ОперацияВыпуска = ВыборкаДетальныеЗаписи.ОперацияВыпуска;
	//		Запись.Бригада = ВыборкаДетальныеЗаписи.Бригада;
	//		Запись.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;	
	//	КонецЦикла;	
	//	Набор.Записать();
	//КонецЕсли;
	//
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	бит_СоставИсполнителейИВремяВыполнения.Смена КАК Смена
	//	|ПОМЕСТИТЬ вт_ПоследняяСмена
	//	|ИЗ
	//	|	РегистрСведений.бит_СоставИсполнителейИВремяВыполнения КАК бит_СоставИсполнителейИВремяВыполнения
	//	|ГДЕ
	//	|	бит_СоставИсполнителейИВремяВыполнения.Бригада = &Бригада
	//	|	И бит_СоставИсполнителейИВремяВыполнения.Смена <> &Смена
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	бит_СоставИсполнителейИВремяВыполнения.Смена.Дата УБЫВ
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	бит_СоставИсполнителейИВремяВыполнения.Смена КАК Смена,
	//	|	бит_СоставИсполнителейИВремяВыполнения.ОперацияВыпуска КАК ОперацияВыпуска,
	//	|	бит_СоставИсполнителейИВремяВыполнения.Бригада КАК Бригада,
	//	|	бит_СоставИсполнителейИВремяВыполнения.Сотрудник КАК Сотрудник
	//	|ИЗ
	//	|	РегистрСведений.бит_СоставИсполнителейИВремяВыполнения КАК бит_СоставИсполнителейИВремяВыполнения
	//	|ГДЕ
	//	|	бит_СоставИсполнителейИВремяВыполнения.Смена В
	//	|			(ВЫБРАТЬ
	//	|				вт_ПоследняяСмена.Смена КАК Смена
	//	|			ИЗ
	//	|				вт_ПоследняяСмена КАК вт_ПоследняяСмена)";
	//
	//Запрос.УстановитьПараметр("Бригада", Бригада);
	//Запрос.УстановитьПараметр("Смена", СменноеЗадание);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если НЕ РезультатЗапроса.Пустой() Тогда
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	
	//	Набор = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
	//	Набор.Отбор.Регистратор.Установить(СменноеЗадание);
	//	
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		Запись = Набор.Добавить();
	//		Запись.Смена = ВыборкаДетальныеЗаписи.Смена;
	//		Запись.ОперацияВыпуска = ВыборкаДетальныеЗаписи.ОперацияВыпуска;
	//		Запись.Бригада = ВыборкаДетальныеЗаписи.Бригада;
	//		Запись.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
	//	КонецЦикла;
	//	
	//	Набор.Записать();
	//	
	//КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СменаПриАктивизацииСтроки()
	
	ТекущиеДанные  = Элементы.бит_Смена.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
				
		//СтруктураОтбора = Новый Структура;
		
		//ТЗСостав = Элементы.бит_Состав;
		//Элементы.бит_Состав.ОтборСтрок = Новый ФиксированнаяСтруктура("СменноеЗадание, ОперацияВыпуска, Бригада", ТекущиеДанные.СменноеЗадание, ТекущиеДанные.ОперацияВыпуска, ТекущиеДанные.Бригада);
		ЭтаФорма["бит_СоставСписок"].Параметры.УстановитьЗначениеПараметра("Смена", ТекущиеДанные.СменноеЗадание);
		ЭтаФорма["бит_СоставСписок"].Параметры.УстановитьЗначениеПараметра("Бригада", ТекущиеДанные.Бригада);

	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура бит_СоставСотрудникПриИзменении(Элемент)
	
	ТекущиеДанныеСмена  = Элементы.бит_Смена.ТекущиеДанные;
	
	Если ТекущиеДанныеСмена <> Неопределено Тогда
		
		ТекущиеДанныеСостав  = Элементы.бит_Состав.ТекущиеДанные;
		
		СменноеЗадание = ТекущиеДанныеСмена.СменноеЗадание;
		ОперацияВыпуска = ТекущиеДанныеСмена.ОперацияВыпуска;
		Бригада = ТекущиеДанныеСмена.Бригада; 
		Сотрудник = ТекущиеДанныеСостав.Сотрудник;            
		
		ТекущиеДанныеСостав.СменноеЗадание = СменноеЗадание;
		ТекущиеДанныеСостав.ОперацияВыпуска = ОперацияВыпуска;
		ТекущиеДанныеСостав.Бригада = Бригада;
		
		Если СотрудникаНетВСоставе(СменноеЗадание, Бригада, Сотрудник) Тогда
		
			ЗаписатьСоставИсполнителей(СменноеЗадание, Бригада);
			
		Иначе
			
			ЭтаФорма.бит_Состав.Удалить(ЭтаФорма.бит_Состав.НайтиПоИдентификатору(Элементы.бит_Состав.ТекущаяСтрока));
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СоставПослеУдаления(Элемент)
	
	ТекущиеДанныеСмена  = Элементы.бит_Смена.ТекущиеДанные;
	
	Если ТекущиеДанныеСмена <> Неопределено Тогда
		
		СменноеЗадание = ТекущиеДанныеСмена.СменноеЗадание;
		ОперацияВыпуска = ТекущиеДанныеСмена.ОперацияВыпуска;
		Бригада = ТекущиеДанныеСмена.Бригада; 
		//Сотрудник = ТекущиеДанныеСостав.Сотрудник;
		
		ЗаписатьСоставИсполнителей(СменноеЗадание, Бригада);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СотрудникаНетВСоставе(Смена, Бригада, Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СоставИсполнителейИВремяВыполнения.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.бит_СоставИсполнителейИВремяВыполнения КАК бит_СоставИсполнителейИВремяВыполнения
		|ГДЕ
		|	бит_СоставИсполнителейИВремяВыполнения.Смена = &Смена
		|	И бит_СоставИсполнителейИВремяВыполнения.Бригада = &Бригада
		|	И бит_СоставИсполнителейИВремяВыполнения.Сотрудник = &Сотрудник
		|	И бит_СоставИсполнителейИВремяВыполнения.Регистратор = &Смена";
	
	Запрос.УстановитьПараметр("Бригада", Бригада);
	Запрос.УстановитьПараметр("Смена", Смена);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервере
Процедура ЗаписатьСоставИсполнителей(СменноеЗадание, Бригада)
	
	//Набор = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
	//Набор.Отбор.Регистратор.Установить(СменноеЗадание);
	//Набор.Прочитать();
	////Для Каждого ЭлМассива Из НайденныеСтроки Цикл
	//	Запись = Набор.Добавить();
	//	Запись.Смена = СменноеЗадание;
	//	Запись.ОперацияВыпуска = ОперацияВыпуска;
	//	Запись.Бригада = Бригада;
	//	Запись.Сотрудник = Сотрудник;
	////КонецЦикла;	
	//Набор.Записать();
	
	//ЭтаФорма.бит_Состав.Свернуть("СменноеЗадание, ОперацияВыпуска, Бригада, Сотрудник");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СоставИсполнителейИВремяВыполнения.Регистратор КАК Регистратор,
		|	бит_СоставИсполнителейИВремяВыполнения.НомерСтроки КАК НомерСтроки,
		|	бит_СоставИсполнителейИВремяВыполнения.Активность КАК Активность,
		|	бит_СоставИсполнителейИВремяВыполнения.Смена КАК Смена,
		|	бит_СоставИсполнителейИВремяВыполнения.ОперацияВыпуска КАК ОперацияВыпуска,
		|	бит_СоставИсполнителейИВремяВыполнения.Бригада КАК Бригада,
		|	бит_СоставИсполнителейИВремяВыполнения.Сотрудник КАК Сотрудник,
		|	бит_СоставИсполнителейИВремяВыполнения.ЧасыНорма КАК ЧасыНорма,
		|	бит_СоставИсполнителейИВремяВыполнения.ЧасыФакт КАК ЧасыФакт,
		|	бит_СоставИсполнителейИВремяВыполнения.КоличествоПлан КАК КоличествоПлан,
		|	бит_СоставИсполнителейИВремяВыполнения.КоличествоФакт КАК КоличествоФакт
		|ИЗ
		|	РегистрСведений.бит_СоставИсполнителейИВремяВыполнения КАК бит_СоставИсполнителейИВремяВыполнения
		|ГДЕ
		|	бит_СоставИсполнителейИВремяВыполнения.Регистратор = &Регистратор
		|	И бит_СоставИсполнителейИВремяВыполнения.Бригада <> &Бригада";
	
	Запрос.УстановитьПараметр("Регистратор", СменноеЗадание);
	Запрос.УстановитьПараметр("Бригада", Бригада);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Очищаем все записи
	Набор = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(СменноеЗадание);
	Набор.Записать();
	
	//Заполняем записи которые не относятся к бригаде
	Если Не РезультатЗапроса.Пустой() Тогда
		Набор = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(СменноеЗадание);	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Запись = Набор.Добавить();
			Запись.Смена = ВыборкаДетальныеЗаписи.Смена;
			Запись.Бригада = ВыборкаДетальныеЗаписи.Бригада;
			Запись.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;	
		КонецЦикла;	
		Набор.Записать();
	КонецЕсли;
	
	//Заполняем записи по операции
	Если ЭтаФорма.бит_Состав.Количество() = 0 Тогда
		Набор = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(СменноеЗадание);
		Набор.Прочитать();
		Запись = Набор.Добавить();
		Запись.Смена = СменноеЗадание;
		Запись.Бригада = Бригада;
		Запись.Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
		Набор.Записать();
	Иначе
		Набор = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(СменноеЗадание);
		Набор.Прочитать();
		Для Каждого СтрокаТЗ Из ЭтаФорма.бит_Состав Цикл
			Если СтрокаТЗ.СменноеЗадание = СменноеЗадание Тогда
				Запись = Набор.Добавить();
				Запись.Смена = СтрокаТЗ.СменноеЗадание;
				Запись.Бригада = СтрокаТЗ.Бригада;
				Запись.Сотрудник = СтрокаТЗ.Сотрудник;
			КонецЕсли;
		КонецЦикла;
		Набор.Записать();
	КонецЕсли;
	
	////СтруктураОтбора = Новый Структура;
	////СтруктураОтбора.Вставить("СменноеЗадание", СменноеЗадание);
	//////СтруктураОтбора.Вставить("ОперацияВыпуска", ОперацияВыпуска);
	////СтруктураОтбора.Вставить("Бригада", Бригада);
	//
	////НайденныеСтроки = ЭтаФорма.бит_Состав.НайтиСтроки(СтруктураОтбора);
	//
	//Набор = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
	//Набор.Отбор.Регистратор.Установить(СменноеЗадание);
	//Набор.Прочитать();
	////Для Каждого ЭлМассива Из НайденныеСтроки Цикл
	//	Запись = Набор.Добавить();
	//	Запись.Смена = СменноеЗадание;
	//	Запись.ОперацияВыпуска = ОперацияВыпуска;
	//	Запись.Бригада = Бригада;
	//	Запись.Сотрудник = Сотрудник;
	////КонецЦикла;
	//
	//Набор.Записать();
	
КонецПроцедуры
                                           
&НаСервере
Процедура ЗаполнитьСписокСмен()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СоставИсполнителейИВремяВыполнения.Смена КАК Смена,
		|	бит_СоставИсполнителейИВремяВыполнения.ДокументПроизводства КАК ДокументПроизводства,
		|	ВЫБОР
		|		КОГДА бит_СоставИсполнителейИВремяВыполнения.Бригада <> Значение(Справочник.Бригады.ПустаяСсылка)
		|			ТОГДА бит_СоставИсполнителейИВремяВыполнения.Бригада
		|		ИНАЧЕ бит_СоставИсполнителейИВремяВыполнения.Сотрудник
		|	КОНЕЦ КАК Бригада
		|ПОМЕСТИТЬ вт_Итоговая
		|ИЗ
		|	РегистрСведений.бит_СоставИсполнителейИВремяВыполнения КАК бит_СоставИсполнителейИВремяВыполнения
		|ГДЕ
		|	бит_СоставИсполнителейИВремяВыполнения.Смена.Подразделение = &Подразделение
		|	И бит_СоставИсполнителейИВремяВыполнения.Смена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСменныхЗаданий.Сформировано)
		//|	И бит_СоставИсполнителейИВремяВыполнения.Бригада.Подразделение = &Подразделение
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_СоставИсполнителейИВремяВыполнения.Смена,
		|	бит_СоставИсполнителейИВремяВыполнения.ДокументПроизводства,
		|	ВЫБОР
		|		КОГДА бит_СоставИсполнителейИВремяВыполнения.Бригада <> Значение(Справочник.Бригады.ПустаяСсылка)
		|			ТОГДА бит_СоставИсполнителейИВремяВыполнения.Бригада
		|		ИНАЧЕ бит_СоставИсполнителейИВремяВыполнения.Сотрудник
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Итоговая.Смена КАК Смена,
		|	вт_Итоговая.ДокументПроизводства КАК ДокументПроизводства,
		|	вт_Итоговая.Бригада КАК Бригада
		|ИЗ
		|	вт_Итоговая КАК вт_Итоговая
		|ИТОГИ ПО
		|	Смена,
		|	Бригада";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗСмена = ЭтаФорма.бит_Смена;
	ТЗСмена.Очистить();
	
	//ТЗСостав = ЭтаФорма.бит_Состав;
	//ТЗСостав.Очистить();
	
	ВыборкаСмена = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСмена.Следующий() Цикл
		
		//ВыборкаОперация = ВыборкаСмена.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		//Пока ВыборкаОперация.Следующий() Цикл
			
			ВыборкаБригада = ВыборкаСмена.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
			Пока ВыборкаБригада.Следующий() Цикл
				
				СтрокаТЗСмена = ТЗСмена.Добавить();
				
				СтрокаТЗСмена.Дата = ВыборкаБригада.Смена.Дата;
				СтрокаТЗСмена.СменноеЗадание = ВыборкаБригада.Смена;
				СтрокаТЗСмена.Бригада = ВыборкаБригада.Бригада;
				
				ЗаполнитьЗначенияСвойств(СтрокаТЗСмена, ВыборкаБригада);	
				
				//ВыборкаСотрудник = ВыборкаБригада.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);			
				//
				//Пока ВыборкаСотрудник.Следующий() Цикл
				//	
				//	Если ЗначениеЗаполнено(ВыборкаСотрудник.Сотрудник) Тогда
				//		
				//		СтрокаТЗСостав = ТЗСостав.Добавить();
				//		СтрокаТЗСостав.СменноеЗадание = ВыборкаСотрудник.Смена;
				//		СтрокаТЗСостав.ОперацияВыпуска = ВыборкаСотрудник.ОперацияВыпуска;
				//		СтрокаТЗСостав.Бригада = ВыборкаСотрудник.Бригада;
				//		СтрокаТЗСостав.Сотрудник = ВыборкаСотрудник.Сотрудник;
				//		
				//	КонецЕсли;
				//	
				//КонецЦикла;
				
			КонецЦикла;
			
		//КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

                                          
&НаКлиенте
Процедура бит_ПриОткрытииПосле(Отказ)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.1] [ASHolyavko@1cbit.ru] [11.11.2025] +        
	
	Элементы.бит_СменаСкопировать.Видимость = Ложь;
   	Элементы.бит_СменаИзменить.Видимость = Ложь;                
	
	Элементы.бит_СоставСписокКонтекстноеМеню.Видимость = Ложь;
	//Элементы.бит_СоставСписокКонтекстноеМенюСкопировать.Видимость = Ложь;
	//Элементы.бит_СоставСписокКонтекстноеМенюИзменить.Видимость = Ложь;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.1] [ASHolyavko@1cbit.ru] [11.11.2025] -
	
КонецПроцедуры


&НаКлиенте
Процедура бит_СоставСотрудникПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура бит_ПодразделениеПриИзмененииПосле(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [28.11.2025] +        
	
	ЗаполнитьСписокСмен(); 
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [28.11.2025] -
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("Назначить")
Процедура бит_Назначить(Команда)

	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
	"Обработка.ФормированиеСменныхЗаданий.Форма.РабочееМесто.НазначитьОперации");

	Если Элементы.Смены.ТекущиеДанные = Неопределено Тогда

		ПоказатьПредупреждениеНеВыбранаСмена();

	Иначе

		КлючиОпераций = ПроверитьПолучитьОперацииДляНазначения(Элементы.Операции.ВыделенныеСтроки);

		Если КлючиОпераций <> Неопределено Тогда
			
			#Вставка
			бит_УстановитьКоличествоХодовНаСервере(КлючиОпераций);
			#КонецВставки
			
			НазначитьОперацииВыбраннойСтроке(КлючиОпераций, Элементы.Смены.ТекущиеДанные);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура бит_УстановитьКоличествоХодовНаСервере(КлючиОпераций)
	
	Порядок = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ОперацииТЗ = РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	Для каждого Ключ Из КлючиОпераций Цикл
		НоваяСтрока = ОперацииТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Ключ);
		НоваяСтрока.Порядок = Порядок;
		
		Порядок = Порядок + 1;
	КонецЦикла;
	
	//КоличествоХодовОперация = бит_ПолучитьКоличествоХодовОперации(ОперацииТЗ);
	
	Документы.СменноеЗадание.УстановитьКоличествоХодовИВремя(ОперацииТЗ);	
	
КонецПроцедуры
